INSERT INTO user (first_name, last_name, dob) VALUES
('Олег', 'Пашкевич', '1972-10-22'),
('Мар''ян', 'Лукаш', null ),
('Світлана', 'Федорчук', null);

INSERT INTO genre (id, name) VALUES
(1, 'Біографія'), (2, 'Детектив'), (3, 'Історичний'), (4, 'Збірка'), (5, 'Пригоди'), (6, 'Психологія'),
(7,'Наукова фантастика'), (8, 'Фентезі'), (9, 'Гумор'), (10, 'Жіночий'), (11, 'Програмування'), (12, 'Нон-фікшн');

INSERT INTO publicity (id, name) VALUES
(1, 'Фабула'),
(2, 'Видавництво Старого Лева'),
(3, 'Oracle Press');

INSERT INTO author (id, first_name, last_name) VALUES
(1, 'Джо', 'Харт'),
(2, 'Скарлет', 'Кертіс'),
(3, 'Сара', 'Паппворт'),
(4, 'Дорж', 'Бату'),
(5, 'Герберт', 'Шилдт');

INSERT INTO book (id, name, annotation, publicity, published) VALUES
(1, 'Як Черчилль урятував світ', 'Дослідник розкриває таємниці подій, що спричинили початок Другої світової війни.', 1, '2019'),
(2, 'Феміністки не носять рожеве', 'збірка творів від 52 різних жінок', 2, '2019'),
(3, 'Це Моне', 'Ілюстрований життєпис Моне', 2, '2019'),
(4, 'Франческа. Володарка офіцерського жетона', 'Друга книга пригод життєрадісної героїні', 2, '2019'),
(5, 'Java 8. Руководство для начинающих', '', 3, '2015'),
(6, 'Java 8. Полное руководство', null, 3, '2016');

INSERT INTO book_author (book_id, author_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 5);

INSERT INTO book_genre (book_id, genre_id) VALUES
(1, 12),
(2, 12),
(2, 4),
(3, 1),
(4, 5),
(4, 9),
(5, 11),
(6, 11);